Revit 2027 API
GradientNoiseType Enumeration
 The enumerated type representing the permitted values for the asset property "GradientNoise" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GradientNoiseType
Public Enumeration GradientNoiseType
public enum class GradientNoiseType
type GradientNoiseType
Members
Member name | Value | Description
Fractal | 2
Regular | 0
Turbulence | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace